USERS: dict[str: str] = {
    'greetings': 'Приветствую. 👋🏻\nЯ чат-бот компании «KanzOboz», я помогу вам '
                 'с трудоустройством и подбором вакансии, после чего с вами '
                 'менеджером.',
    'company': 'Основное направление деятельности нашей компании - '
               'производство и продажа канцелярских товаров по всей России. '
               'Мы занимаем большую долю рынка и осуществляем свою '
               'деятельность уже более 15 лет.\nГлавная ценность компании - '
               'наши сотрудники! Мы предоставляем комфортные условия труда, '
               'высокую заработную плату с ежедневными выплатами, гибкий '
               'график и специальные бонусы.',
    'main_manu': 'Вы в главном меню',
    'no_access': 'Сначала перейдите во вкладку О компании',
    'employment_info': 'Чтобы закрепить за вами место к дате встречи, '
                       'заполните небольшую вводную анкету.\nСогласны?',
    'refusal': 'Спасибо за обращение, можете посмотреть другие вакансии, '
               'возможно, они вам приглянутся больше.',
    'agreement': 'Так же сразу хочу предупредить Вас, что трудоутройство '
                 'возможно лишь через 7-10 дней, так как за это время мы '
                 'подготовим всё необходимое, есть ли у вас возможность '
                 'ждать столько?',
    'name_request': 'Отлично. Напишите как я могу к вам обращаться?',
    'city_request': 'В каком городе планируете трудоустройство?',
    'vacancies_request': 'Вакансия на которую планируете трудоустроиться:',
    'type_employment': 'Напишите желаемый вид трудоустройства:',
    'schedule': 'Остался последний момент, напишите желаемый график работы '
                '(например, Пн-Пт, 8.00-18.00):',
    'end_questionnaire': 'Все данные собраны, менеджер свяжется с вами '
                         'через 10-15 минут!',
    'jobs_in_city': 'Желаете посмотреть вакансии в вашем городе?',
    'city_input_2': 'Я могу подобрать вакансии, подходящие именно вам! '
                    'Укажите город вашего проживания:',
    'interesting_vacancies': 'Укажите интересующую вас вакансию:',
    'types_employment': 'Работа в данной должности возможна по следующим '
                        'видам занятости:'
}

KEYBOARDS: dict[str: str] = {
    'vacancies': 'Актуальные Вакансии 🗂',
    'about_company': 'О компании ℹ️',
    'employment': 'Трудоустройство 🤝',
    'back_menu': 'Меню 📋',
    'yes': 'Да ✅',
    'no': 'Нет 🚫',
    'all_right': 'Всё верно',
    'correct': 'Исправить',
    'show_vacancies': 'Показать вакансии 🗂',
    'general': 'Общее',
    'middle': 'Среднее',
    'high': 'Высшее'
}
