USERS: dict[str: str] = {
    'greetings': 'Добро пожаловать!',
    'company': 'Это компания',
    'main_manu': 'Вы в главном меню',
    'no_access': 'Сначала перейдите во вкладку О компании',
    'employment_info': 'Чтобы закрепить за вами место к дате встречи, '
                       'заполните небольшую вводную анкету.\nСогласны?',
    'refusal': 'Спасибо за обращение, можете посмотреть другие вакансии, '
               'возможно, они вам приглянутся больше',
    'agreement': 'Так же сразу хочу предупредить Вас, что трудоутройство '
                 'возможно лишь через 7-10 дней, так как за это время мы '
                 'подготовим всё необходимое, есть ли у вас возможность '
                 'ждать столько?',
    'name_request': 'Отлично. Напишите как я могу к вам обращаться?',
    'city_request': 'В каком городе планируете трудоустройство?',
    'vacancies_request': 'Вакансия на которую планируете трудоустроиться:',
    'type_employment': 'Напишите желаемый вид трудоустройства',
    'schedule': 'Остался последний момент, напишите желаемый график работы:',
    'end_questionnaire': 'Все данные собраны, ждите ответа!'
}

KEYBOARDS: dict[str: str] = {
    'vacancies': 'Актуальные Вакансии',
    'about_company': 'О компании',
    'employment': 'Трудоустройство',
    'back_menu': 'Меню',
    'yes': 'Да',
    'no': 'Нет'
}
