USERS: dict[str: str] = {
    'greetings': 'Добро пожаловать!',
    'company': 'Это компания',
    'main_manu': 'Вы в главном меню',
    'no_access': 'Сначала перейдите во вкладку О компании',
    'employment_info': 'Чтобы закрепить за вами место к дате встречи, '
                       'заполните небольшую вводную анкету.\nСогласны?',
    'refusal': 'Спасибо за обращение, можете посмотреть другие вакансии, '
               'возможно, они вам приглянутся больше',
    'agreement': 'Так же сразу хочу предупредить Вас, что трудоутройство '
                 'возможно лишь через 7-10 дней, так как за это время мы '
                 'подготовим всё необходимое, есть ли у вас возможность '
                 'ждать столько?'
}

KEYBOARDS: dict[str: str] = {
    'vacancies': 'Актуальные Вакансии',
    'about_company': 'О компании',
    'employment': 'Трудоустройство',
    'back_menu': 'Назад в главное меню',
    'yes': 'Да',
    'no': 'Нет'
}
